// 0 neutral, 1 happy, 2 sad, 3 shy blushing, 4 happy blushing (love), 5 angry, 6 crying, 7 surprised, 8 laughing
{

  "Introduction": "People been talkin' about you coming to town. Nice to finally meet you.#$b#Me? Name's Sorren. I keep to myself. Maybe I'll see you at the saloon some time.",
  "danceRejection": "Sorry, I'm not much for dancing.",
  "Divorced": "Please don't talk to me. I'm better off alone.$2",
  "secondChance_Guys": "I don't want to lose you. I'm willing to start again if you are.$3",
  "Blacksmith": "Hey, @. I come here to sell the ores I mine up.#$e#Clint isn't bad company, either, once you get to know him.",
  "BlackSmith2": "Working hard on those upgrades? I'll keep Clint supplied with plenty of ore in case you want to buy some.",
  "Blacksmith4": "Clint is a cool guy. Neither of us are very talkative. Maybe that's why we get along.#$e#Well, that and the fact that we both like working with metal.$1",
  "Blacksmith6": "Clint let me use the forge once. It's harder to shape things out of metal than I thought it would be.$1",
  "Mountain_Tue": "I'm getting too old for this. I keep having to take breaks.$5",
  "Mountain_Tue2": "What do you mean, I never work? Of course I do! I'm just getting some air.$5",
  "Mountain_Tue4": "Hi, @. Been to the Adventurer's Guild? They can help you get set up to fight the monsters down in the lower levels.",
  "Mountain_Tue6": "Never go down in the mines without a weapon to defend yourself. Farm tools will only get you so far.",
  "Mountain_Thu": "Just taking a breather, don't mind me.",
  "Mountain_Thu2": "Cracking open a rock with your pickaxe can be kinda fun, you know.",
  "Mountain_Thu4": "Make sure you take some food with you if you're going down in the mines. Never know what you might find down there.",
  "Mountain_Thu6": "It's so quiet and calm up in the mountains.#$q 247104/247105 qwhittle_1#I like to whittle out here under my favorite tree.
	#$r 247104 10 qwhittle_what#What do you whittle?
	#$r 247104 10 qwhittle_cool#That's really cool!
	#$r 247105 -10 qwhittle_no#Wood shavings and splinters? No thanks.",
	"qwhittle_what": "Little things like animal figurines, mostly. I took it up when I lived in Grampleton. It's really relaxing once you get the hang of it.$1",
	"qwhittle_cool": "You think so? People usually think of it as an old man's hobby. It's just little stuff, but I love it.$4",
	"qwhittle_no": "Well, you're not the one doing it. You're more likely to cut yourself with the knife than get a splinter, anyway.$5",
	"qwhittle_1": "$p 247104#Maybe I'll make you something some time. You've got animals on the farm to model it after, right?#$b#Uh, if that's okay with you.$3",
  "Mountain_Fri": "Be careful down in the mines, farmer. The lower you go, the more dangerous it gets.",
  "Mountain_Fri2": "Going mining? Here, take this. [78]#$e#Don't look at me like that. I'm just taking a break.$5",
  "Mountain_Fri4": "My favorite levels of the mines are the icy ones. Feels good to work up a sweat down there.$1#$b#Just make sure you come back up after a while. You don't want to catch a cold.",
  "Mountain_Fri8": "Hey there, @! Good to see you here.$1#$b#This might sound funny, but I get a little extra energy whenever I see you. You inspire me to work a little bit harder.$4",
  "Mountain_Sat": "Someone was throwing rocks at that poor homeless guy's tent. If I find out who did it, I'll give 'em a piece of my mind, that's for sure.$5",
  "Mountain_Sat2": "Linus is a good guy. I respect him trying to live life on his own terms.",
  "winterMountain": "When the mountain is covered in snow, it reminds me of home...",
  "winterMountain4": "Isn't it beautiful here? I grew up in the mountains, up north where it's cold more often.$1",
  "Mon": "Uh, hi, I guess.",
  "Mon2": "Stardew Valley is a nice place. The people here all know each other.",
  "Mon4": "Penny is a sweet girl, but that mom of hers makes a ruckus in the saloon some nights.$2",
  "Tue": "%Sorren nods at you amiably, but he doesn't seem to be in a talking mood.",
  "Tue2": "I don't like Tuesdays. You know how some people call Wednesday Hump Day? I think my Hump Day is Tuesday.$2",
  "Tue4": "I'm tired today. You ever have days like that, @? Maybe I'm getting old.",
  "Tue6": "A lot of the single people around here are at least ten years younger than me.#$b#Makes me feel kinda old.$2",
  "Wed": "I wasn't always a miner, but it's in my blood, so I guess it was inevitable.",
  "Wed2": "Back in Grampleton, there was a lot of wood to work with. I still whittle sometimes.",
  "Wed4": "You go mining much, @? It's a great way to blow off some steam.",
  "Wed8": "What's up, @? Did you come to see me?$4",
  "Thu": "Sorry, I'm not very good at small talk.$3",
  "Thu2": "Hi, @. Can I ask you a question?#$q 247106/247107 qwork_1#How does it feel to work so closely with the earth?
	#$r 247106 0 qwork_earthy#Uh... earthy, I guess?
	#$r 247107 10 qwork_hands#I like getting down in the dirt and working with my hands.
	#$r 247107 10 qwork_grow#It's amazing to nurture plants and watch them grow.",
	"qwork_earthy": "Well, that makes sense. I don't know what I expected.",
	"qwork_hands": "I feel the same way. Working up a sweat and getting dirty is so worth it in the end. #$b#Not to mention, you work up such an appetite that whatever you eat afterwards tastes even more delicious!$1",
	"qwork_grow": "Wow, that does sound pretty great. I don't know if I'd have the patience, though.$1",
	"qwork_1": "$p 247107#Farming sounds like rewarding work. Just make sure you take a break once in a while. There is such a thing as working too hard.",
  "Thu4": "Are you eating enough? You can't do farm work running on empty.",
  "Thu6": "Hey, @, good to see you! Hope you're taking care of yourself.$1",
  "Fri": "Almost time for the weekend. Doesn't much matter for you or me, though, does it?",
  "Fri2": "Must be nice growing your own fruits and veggies. Home-grown produce tastes better than the stuff in supermarkets.$1",
  "Fri4": "Do you fish, @? Nothing like a good fish dinner.$1#$e#Mmm, fish... Oops, I'm making myself hungry.",
  "Fri6": "Willy convinced me to go fishing with him the other day. I brought my catch back to Gus and we both had a good meal.$1",
  "Sat": "When I was a kid in school, I always looked forward to the weekend.#$b#When you grow up, you realize weekends are just like any other day.",
  "Sat2": "The people in town are more lively on Saturdays. Everybody needs a break once in a while.",
  "Sat4": "I've been thinking about putting down roots here in Stardew Valley. Just don't know how I'd go about it...",
  "Sat6": "Do you think Robin would build me a house? Guess I'd have to scrape together a good bit of money first.#$e#Haha, maybe I'll get a tent and live in the mountains like Linus.$1",
  "Sat8": "Doing anything fun today, @? Don't forget to take some time for yourself now and then.$1",
  "Sun": "No such thing as a day of rest for me. I prefer to keep busy.",
  "Sun4": "I don't know if I believe in Yoba, but I do believe that every living thing has a spirit.",
  "Sun6": "Gus lets me cook in the kitchen on occasion. We don't have the ingredients for it here, but I can make a mean raspberry crepe!$1",
  "spring_12": "Oh yeah, the Egg Festival's tomorrow. It's all about fertility and birth, right? Something like that.",
  "spring_23": "You know it's spring when daffodils first poke up out of the ground.#$b#A Spring Flower Dance sounds like an apt celebration.$1",
  "summer_Mon": "I don't like the summer. It's too hot. I'm used to cooler temperatures.$2",
  "summer_Tue": "The mines are nice and cool in the summer. I don't like spending too much time in the sun on days like this.",
  "summer_Wed2": "You doing okay, farmer? Make sure to keep hydrated in this heat!",
  "summer_Thu2": "Short hair is good for keeping cool, but it's still hot if you're standing right in the sun.#$e#Maybe I should get a hat...",
  "summer_Sat6": "I never went to the beach in the summer when I was a kid. We were too far away from the ocean. I'd go now, but...#$q 247107/247108 qswim_1#Isn't that a bit silly at my age?
	#$r 247107 -15 qswim_sad#Yeah, that would be sad for a grown man.
	#$r 247108 5 qswim_notold#You're not even that old.
	#$r 247108 10 qswim_go#No way, go for it!",
	"qswim_sad": "Yeah, that's what I thought.$2",
	"qswim_notold": "What? I'm like ten or even twenty years older than most of the unmarried people around here.$2#$b#Well, if you don't think I'm too old, then maybe I should try it...$3#$b#Thanks!$4",
	"qswim_go": "Yeah, I guess you're right. No time like the present, huh?$1",
	"qswim_1": "$p 247108#Thanks for the advice, @. No sense missing out on something if I don't have to.$4",
  "summer_10": "The Luau is tomorrow, right? I heard there'll be soup. I might take mushrooms if I can find any.",
  "summer_16": "%Sorren looks so sad that you decide not to bother him right now.",
  "summer_27": "Sounds like tomorrow night's going to be a special night. Maybe I'll go, too. It's not so hot when the sun goes down.",
  "fall_Mon": "The trees look especially beautiful this time of year.",
  "fall_Mon2": "Ah, just breathe in that crisp autumn air!$1",
  "fall_Mon4": "My birthday's coming up. *sigh* Sometimes I just feel so old.$2",
  "fall_Tue": "Doesn't matter if I get sweaty working in this season. I just come outside and the wind dries me right up.",
  "fall_Tue4": "You can catch salmon this time of year. Pan sear 'em in butter, spritz with a little lemon - mmm, delicious.$1",
  "fall_Tue8": "Wanna grab a drink with me some time? Or a bite to eat, whatever. Gus cooks up some great food this time of year.$1",
  "fall_Wed": "The forest seems almost magical in the fall.",
  "fall_Wed4": "Maybe I'll go fishing with Willy. Or... Hey, @, do you know how to find lobsters?",
  "fall_Fri": "This season is a busy time for farmers, huh?",
  "fall_Fri7": "Watching Jas and Vincent run around makes me feel like maybe I missed out on settling down and having a family.$2",
  "fall_Sat": "The cool breeze, the colorful leaves, the festivals... Fall just feels cozy, doesn't it?",
  "fall_Sat4": "Should I carve a pumpkin? Seems a bit silly for someone my age.$3",
  "fall_Sun": "It's grape season, and that means wine.#$b#It sounds a bit snobby, but I do enjoy a nice glass of wine now and then.$1",
  "fall_15": "Grampleton had a fun fair, though it was a bit different from Stardew Valley's. You planning on going this year?",
  "fall_26": "I'm not sure I'll go to the Spirit's Eve Festival. I don't like to think about the dead any more than I have to.$2#$b#What? No, I'm not scared!$5",
  "winter_Tue": "My job is technically indoors, so winter doesn't slow me down.",
  "winter_Tue4": "I love snow. Up north where I grew up, we got loads of it.$1",
  "winter_Wed": "You can lose track of time in the mines, especially when you don't have anything else important to do.",
  "winter_Wed4": "Haley said I look really pale in winter. Maybe I should come out of the mines a little more often.$3",
  "winter_Thu": "No crops to grow in winter. You should go mining!$1",
  "winter_Thu4": "Make sure to bundle up, @. You don't want to catch a cold.",
  "winter_Fri": "You're always running around no matter the weather, huh?",
  "winter_Fri4": "This time of year makes people want to spend time with family, but my folks died years ago.$2",
  "winter_Fri8": "This is perfect weather for cuddling up under some blankets and watching the snow fall.$3",
  "winter_Sat": "You can see the stars really clearly on a cloudless winter night.",
  "winter_Sun": "Another year just about over...",
  "winter_Sun4": "This year seemed to fly by. I'll almost be sad when it's over.$1",
  "winter_7": "An ice festival sounds like something right up my alley.$1",
  "winter_24": "Willy told me an interesting story about the Winter Star. Stardew Valley sure is full of surprises.",
  "give_flowersA": "Flowers? For me? Oh, how sweet...$4#$b#What do you mean, you want to date? We're already together, silly.$1.",
  "give_flowersB": "Wow, what's the occasion? Wait, you're giving these to me?$3#$b#@... I... I'm glad you feel that way about me. I feel the same way about you.$4",
  "give_pendant": ". . . .$6#$b#Yes, I'll marry you!$8#$b#I'll talk to the mayor about getting everything ready. It should only take a few days.$4#$b#Oh, @, I'm so happy! I was thinking about asking you, actually, but I like it better this way.$4",
  "stardrop_gift": "I, uh, wanted to give you something special. You've been so good to me. I'm proud to be your husband, @.$4",
  "doyoumine_yes": "Figured as much. We have something in common then.$1",
  "doyoumine_no": "Not much in here except on the lower floors. Though I could swear I hear footsteps sometimes. Light ones, like someone small.",
  "doyoumine_friend": "Why would you do that? I'm not that interesting...$3",
  "whyfriends_interesting": "Haha, Clint, did you hear that? @ says I'm interesting!$8#$b#%Sorren claps you on the back so hard you bump into the table.#$b#Oops, sorry. Guess I don't know my own strength.$4",
  "whyfriends_cute": "No, you're cute!$4#$b#Uh, did I say that out loud? Maybe I've had a little too much to drink.$3",
  "whyfriends_idk": "Well, you and me, both. But I'm glad you do.$1",
  "hurt_nodie": "Not right now, but you will eventually, sooner or later.$2#$b#It sucks, but that's just how life works.$2",
  "hurt_worthit": ". . .$2#$b#Yeah, I guess you're right.$3#$b#If we're all going to die anyway, we might as well do the best we can with the time we're given.#$b#Theo made me really happy. We had some good times while he was alive.$1#$b#If I had to get rid of all that to get rid of the pain, I wouldn't. I'd keep everything.",
  "hurt_suckitup": "I know... It's just so hard to do that.$2#$b#But I guess I just have to keep moving forward.",


}