{
  "Rainy_Day_0": "The rain is watering the crops today.$1#$e#Ah, but of course you're going out anyway. It's the life of a farmer.",
  "Rainy_Day_1": "If your clothes get wet in the rain today, I'll be happy to wrap you up in warm blankets and snuggle you dry!$8",
  "Rainy_Day_2": "I think I'll stay inside today and practice cooking some of your favorites.$1",
  "Rainy_Day_3": "Good morning, love.$4#$e#It's raining out. Don't catch a cold!",
  "Rainy_Day_4": "Looks wet out there today. Don't you want to have a day in with me?",
  "Rainy_Day_Sorren": "I actually like the rain. Raindrops feel good falling on my face.$1",
  "Rainy_Night_0": "It was so quiet today. I'm glad you're home, sweetheart.$4",
  "Rainy_Night_3": "*yawn* Rainy days make me sleepy. Ready to turn in?$1",
  "Rainy_Night_4": "The rain sounds so peaceful on the roof. Come to bed, love.$4",
  "Rainy_Night_5": "I swept the floors and did the dishes today.$1#$b#Wanna reward me?$8",
  "Rainy_Night_Sorren": "It's been so dark all day, it makes me wanna light some candles.$4",
  "Indoor_Day_0": "Morning, love! Did you sleep well?$8#$e#Try not to work too hard.$1",
  "Indoor_Day_1": "@, I made breakfast. Eat up!$8 [194 195 201 210 211]",
  "Indoor_Day_2": "Good morning, love.$4#$e#Are you ready for working the farm?$1",
  "Indoor_Day_3": "I couldn't do what you do with the farm. You've really brought this place to life, @.$8",
  "Indoor_Day_4": "I actually don't miss mining at all.#$e#Being a house husband really suits me.$4",
  "Indoor_Day_Sorren": "Have a good day today. Love you!$4",
  "Indoor_Night_0": "Did you have a productive day today?$1#$e#I'm in a cuddling mood. Let's go to bed early.$4",
  "Indoor_Night_1": "Hang on, @, you've got a little dirt on your face.#$b#There, got it... Are you blushing?$8",
  "Indoor_Night_2": "I got a lot of work done around the house today.$1#$e#What do you mean, there's not much to do?$5#$b#Well, okay, some of that 'work' was whittling...$3",
  "Indoor_Night_3": "Hey, sweetheart. Wanna have a glass of wine and stay up late?$4",
  "Indoor_Night_4": "Ready for bed? I sleep so well when you're lying next to me, @.$4",
  "Indoor_Night_Sorren": "Aw, you look tired. Let's go to bed, love.",
  "Outdoor_0": "Morning! It's a lovely day out, isn't it?$1",
  "Outdoor_1": "Anything I can do to help?#$e#Not that I'm that good at farm work...$3",
  "Outdoor_2": "Hello, love. Nice weather for farm work, huh?$1",
  "Outdoor_3": "What's cookin', good lookin'?$8#$b#Actually, I made lunch for you. Can't work on an empty stomach!$4 [198 202 204 214 240 241]",
  "Outdoor_4": "Hey sweetie, are you thirsty? Here.$1 [395]",
  "Outdoor_Sorren": "Think I should go do some mining?#$b#...Nah!$8",
  "OneKid_0": "I always wanted to be a dad, and now I am one!$8",
  "OneKid_1": "%kid1 has your smile, I think.$4",
  "OneKid_2": "I don't mind taking care of %kid1 while you work.#$e#In fact, I think I prefer babysitting to mining.$1",
  "OneKid_3": "So many things have changed since our little one arrived.#$e#I wouldn't have it any other way.$4",
  "TwoKids_0": "I couldn't have asked for sweeter children than %kid1 and %kid2.$1",
  "TwoKids_1": "I'm going to do arts and crafts with the kids today.$1#$e#When you get home this evening, they can show you what they made!$8",
  "TwoKids_2": "Do you think the kids will be farmers too one day?#$e#Maybe one of them will take up whittling.$1",
  "TwoKids_3": ". . .$4#$b#Hm? Oh, I was just thinking how nice it is to have a family like this.$8",
  "Good_0": "I love being married to you. You're such a sweetheart, @.$4",
  "Good_1": "I love you, @.$4#$e#What, can't a man tell his spouse he loves them whenever he feels like it?$8",
  "Good_2": "Remember when I would barely talk to you at all?#$b#I can't imagine not talking to you now. I'm glad you took the time to get to know me.$4",
  "Good_3": "D-Did you just wake up looking like that?$3#$b#No, you look amazing! Like, I can't take my eyes off you amazing...$4",
  "Good_4": "You're so cute sometimes, you know that? I'm so lucky to be your husband.$4",
  "Good_5": "I want to spoil you rotten with good food and good... kisses.$8",
  "Good_6": "When you come home tonight, I'll give you a nice... long... backrub.$8",
  "Good_7": "You work so hard for us, @. Thank you... for everything.$4",
  "Good_8": "Don't stay out too long today, okay?#$e#I miss you when you're gone, you know.$4",
  "Good_9": "Hello, my love.$4#$b#Ooh, I feel all sappy today.$3#$b#You like it, though, don't you?$8",
  "Neutral_0": "Hmm, I wonder what I should have for lunch today...",
  "Neutral_1": "Are you happy, @?#$e#I hope you are happy...$3",
  "Neutral_2": "Don't work too hard, okay? I feel like I don't see you as much lately.",
  "Neutral_3": "*yawn* I think I might go take a nap.",
  "Neutral_4": "I burned breakfast this morning.$2#$b#Guess I wasn't paying enough attention.$3",
  "Neutral_5": "I'm getting a little stir-crazy lately.#$e#Maybe I should go take a walk in the woods.",
  "Neutral_6": "Are you tired today, too? No? Just me then.",
  "Neutral_7": "Seems like the housework never ends around here.",
  "Neutral_8": "Couldn't you stay home today?$3#$e#*sigh* No, you're right, the farm doesn't take a day off.$2",
  "Neutral_9": "The key to a successful relationship is communication.#$e#You know you can always talk to me, right?$3",
  "Bad_0": "Sorry, I'm kinda tired today.$2",
  "Bad_1": "I feel so old lately...$2",
  "Bad_2": "It's been a while since we cuddled...$3",
  "Bad_3": "You won't leave me, will you? I don't think I could bear that.$2",
  "Bad_4": ". . . .$6#$e#S-Sorry, I'm just having a bad day today.$2",
  "Bad_5": "Please, just be honest with me, @.",
  "Bad_6": "You've been working so much lately that I never see you.$2",
  "Bad_7": "Are you avoiding me, @?$2",
  "Bad_8": "...Not tonight.$3",
  "Bad_9": "Why do I keep thinking about Theo's death?$2",
  "spring_1": "Happy New Year, sweetheart! Kiss me for good luck.$8",
  "spring_8": "Spring has sprung, as they say.#$b#Want me to get you some flowers?$4",
  "spring_23": "Go ahead and dance with someone at the festival tomorrow, if you want. I won't mind.#$e#You can come home and 'dance' with me afterwards.$4",
  "summer_1": "It'll be warm out now. Make sure you don't get heatstroke!",
  "summer_8": "Wanna go for a swim? Or how about a long, romantic walk on the beach?$4",
  "summer_16": "It's the anniversary of Theo's death today.$2#$e#But you know what? I think he'd be happy that I found you.$4",
  "fall_1": "It really feels like fall out now.#$e#I'm glad; summer is too hot.$1",
  "fall_8": "The orange and red leaves really make me want to go on a picnic in the forest.$1",
  "fall_15": "My birthday's coming up. Are you going to get me anything special?$3",
  "fall_26": "You go on to the festival without me, love. I prefer not to disturb the dead.",
  "winter_1": "I'm so ready for lots of snow! Aren't you?$1",
  "winter_7": "You gonna go fishing tomorrow for the contest? Knock 'em dead!$4#$e#Maybe bring back a couple for me to cook up, huh?$1",
  "winter_28": "It's been a wonderful year. I'm glad I got to spend it with you.$4#$e#To the new year! I got you a gift.$8 [348 243 337]",
  "patio_Sorren": "Ahh, it's nice out. I think I might do some whittling today.$1",
  "funLeave_Sorren": "Hey, sweetheart. I'm going down to the beach to look for driftwood.",
  "funReturn_Sorren": "Got a couple nice pieces of driftwood for whittling. Maybe I'll make something to put on the mantle.$4"

}